## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: terraform
**Workspace**: default
**Success**: :thumbsup:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.gke-cinema.google_container_cluster.primary has changed
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-cinema/locations/us-central1/clusters/cinema"
        name                        = "cinema"
        # (27 unchanged attributes hidden)

!       node_config {
!           machine_type      = "n2d-standard-2" -> "n2-highcpu-4"
            tags              = [
                "gke-cinema",
                "gke-cinema-core",
            ]
            # (12 unchanged attributes hidden)

            # (2 unchanged blocks hidden)
        }

!       node_pool {
!           initial_node_count          = 2 -> 1
!           instance_group_urls         = [
-               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-d64b9aac-grp",
-               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-b/instanceGroupManagers/gke-cinema-core-5db22699-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroupManagers/gke-cinema-core-ca35a070-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-b/instanceGroupManagers/gke-cinema-core-66d7c72d-grp",
            ]
!           managed_instance_group_urls = [
-               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroups/gke-cinema-core-d64b9aac-grp",
-               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-b/instanceGroups/gke-cinema-core-5db22699-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-a/instanceGroups/gke-cinema-core-ca35a070-grp",
+               "https://www.googleapis.com/compute/v1/projects/terrateam-cinema/zones/us-central1-b/instanceGroups/gke-cinema-core-66d7c72d-grp",
            ]
            name                        = "core"
!           node_count                  = 2 -> 1
            # (3 unchanged attributes hidden)

!           autoscaling {
!               max_node_count       = 8 -> 2
!               min_node_count       = 2 -> 1
                # (2 unchanged attributes hidden)
            }

!           node_config {
!               machine_type      = "n2d-standard-2" -> "n2-highcpu-4"
                tags              = [
                    "gke-cinema",
                    "gke-cinema-core",
                ]
                # (12 unchanged attributes hidden)

                # (2 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (17 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.google_service_account.gke-external-dns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_service_account" "gke-external-dns" {
+       account_id   = "external-dns@terrateam-cinema.iam.gserviceaccount.com"
+       display_name = (known after apply)
+       email        = (known after apply)
+       id           = (known after apply)
+       name         = (known after apply)
+       unique_id    = (known after apply)
    }

  # google_service_account_key.external-dns must be replaced
-/+ resource "google_service_account_key" "external-dns" {
!       id                 = "projects/terrateam-cinema/serviceAccounts/external-dns@terrateam-cinema.iam.gserviceaccount.com/keys/24c76bdbdf2bdb2051b7caa6c5edccafc9cb094c" -> (known after apply)
!       name               = "projects/terrateam-cinema/serviceAccounts/external-dns@terrateam-cinema.iam.gserviceaccount.com/keys/24c76bdbdf2bdb2051b7caa6c5edccafc9cb094c" -> (known after apply)
!       private_key        = (sensitive value)
!       public_key         = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvRENDQWVTZ0F3SUJBZ0lJSHRDM2VuWnRRUGt3RFFZSktvWklodmNOQVFFRkJRQXdJREVlTUJ3R0ExVUUKQXhNVk1UQTJNall6TXpNM01qTXdNREEyTXprM05Ea3dNQ0FYRFRJeU1Ea3hPVEEyTWpZME5Gb1lEems1T1RreApNak14TWpNMU9UVTVXakFnTVI0d0hBWURWUVFERXhVeE1EWXlOak16TXpjeU16QXdNRFl6T1RjME9UQXdnZ0VpCk1BMEdDU3FHU0liM0RRRUJBUVVBQTRJQkR3QXdnZ0VLQW9JQkFRRHhoUHk1TUxEYW9EVnpZQTVlY2szdXNQR0oKWmYrRDBJUjM4UTBCK0ZMZjlIZ2dPWno3YzRScWtWQUthT2NRaTMybms3elBXT2RUekVydzdmVXFDWnovMXlJRwo5cWlIbFVSWEpCUkxaNSthRjRsUFd1bGxZSFFMZG8xNWoxOGpxOW45bVhTMzNoMllSbmxhaFZHOEVjcFkyRFJxCjYxVjl3dE9ZUlFrV2ZJZnJ6Ulc5cHRhc0wzNlNRU3IzSGlsNVBRV1pBTjFCVWhYTmc1cHRGMTF0ZVJGYkJIdDgKSnQ0dzBwRVBBL09OK2hScWRTVDlkc0ZYNE9VQzZpTk9aeVNlRFNYdUhkTFI4VnRXUnlRRTJlQUFqeGhieG8reApqaDlzY0NHK29mVzhOd1pzU0x2cFpnbVBibVRLMUJkYlZDQ3BKc3B6aDlYVnlObnM0d3NRdWVJUlYzTnRBZ01CCkFBR2pPREEyTUF3R0ExVWRFd0VCL3dRQ01BQXdEZ1lEVlIwUEFRSC9CQVFEQWdlQU1CWUdBMVVkSlFFQi93UU0KTUFvR0NDc0dBUVVGQndNQ01BMEdDU3FHU0liM0RRRUJCUVVBQTRJQkFRRG9Wc0VtQVdJa3NrVlYrcWIwZ2M1cApsazgvY0c3NzVIdVNoYVNUZEZmUU5PQTVSTGZvWkc4eVE5cFVrajdoZmxEQlNFSUtTVkZtNEVKMTB6ME84ZENsCkRLNGdFZExySElMYkY1N3hka2lJTi9WVjFPRFVTK1o4cDU5Q3lMbjk4Qm1zQUdsejR0UlE5a2lhWkM3cmREUTQKWkFzeklrSXZzMVNHMTAwa29EU0FUSlRJeCtERm1jMUhqQ2RVWHdmbHArRm9mUVg4TjZlcE9kM3NDSnBlNjR6WgpYZ2JnRDhmU25ScFc1bGVwNUF2ZW5HajNnVnBMazJlWjNJZTVIT1lQYVNUUEIrYUkxcFNnN1NvSDZYVUZUY2RICjVRL3Z6K0lMdG5Sb29BV1lMQUZoTEQ0T05Qd0xQdldRZ3NUNmtmNTVibmtDSHdsVU1Yak5ZQXN0MHVJUDdqd2MKLS0tLS1FTkQgQ0VSVElGSUNBVEUtLS0tLQo=" -> (known after apply)
!       service_account_id = "projects/terrateam-cinema/serviceAccounts/external-dns@terrateam-cinema.iam.gserviceaccount.com" -> (known after apply) # forces replacement
!       valid_after        = "2022-09-19T06:26:44Z" -> (known after apply)
!       valid_before       = "9999-12-31T23:59:59Z" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # kubernetes_namespace.cinema will be updated in-place
!   resource "kubernetes_namespace" "cinema" {
        id = "cinema"

!       metadata {
!           annotations      = {
-               "mesh.cloud.google.com/proxy" = jsonencode(
                    {
-                       managed = "true"
                    }
                ) -> null
            }
            name             = "cinema"
            # (4 unchanged attributes hidden)
        }
    }

  # kubernetes_secret.external-dns-credentials will be updated in-place
!   resource "kubernetes_secret" "external-dns-credentials" {
!       data      = (sensitive value)
        id        = "dns/external-dns"
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.gke-cinema.google_container_cluster.primary will be updated in-place
!   resource "google_container_cluster" "primary" {
        id                          = "projects/terrateam-cinema/locations/us-central1/clusters/cinema"
        name                        = "cinema"
!       node_locations              = [
-           "us-central1-b",
            # (1 unchanged element hidden)
        ]
        # (26 unchanged attributes hidden)

        # (19 unchanged blocks hidden)
    }

  # module.gke-cinema.google_container_node_pool.pools["core"] will be updated in-place
!   resource "google_container_node_pool" "pools" {
        id                          = "projects/terrateam-cinema/locations/us-central1/clusters/cinema/nodePools/core"
        name                        = "core"
!       node_locations              = [
-           "us-central1-b",
            # (1 unchanged element hidden)
        ]
        # (9 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:terraform workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```


---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
